Public Attributes | List of all members
API_LineType Struct Reference
Element Manager
Represents a 2D line. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Elem_Head  | head
General element header.
 API_ExtendedPenType  | linePen
(Overridden) pen attribute index.
 API_AttributeIndex  | ltypeInd
Line type attribute index.
 bool  | roomSeparator
Is this line a zone boundary?
short  | determination
Line category:
 API_ArrowData  | arrowData
Arrow data for the line ends.
 double  | penWeight
Pen weight for the line (can override the weight in linePen, otherwise set it to API_DefPenWeigth: use default weight of the pen).
 API_Coord  | begC
Coordinate of the first point.
 API_Coord  | endC
Coordinate of the second point.
Detailed Description
Represents a 2D line.
Member Data Documentation
◆ determination
 API_LineType::determination
Line category:
 Determination  | Meaning
 APILine_DetOrigin  | Default line category. Lines in the Drafting line category are not affected by the Line
 Weight and Section Fill settings chosen in Display Options.
 APILine_DetInnerLine  | A skin separator line separates skins of composite structures. Lines in the Skin
 Separator category will be either hidden or shown depending on the Cut Fill type chosen in Display Options.
 Also, lines in the Skin Separator category can be optionally placed onto their own layer during DXF/DWG conversion functions.
 APILine_DetContourLine  | Lines in the Cut line category will be affected if you have chosen the 'Bold Cut
 Line' setting in the Line Weight menu of Display Options.